[
  {
    "id": 1,
    "name": "Казахский национальный университет имени Аль-Фараби",
    "description": "Один из ведущих университетов Казахстана, предлагающий программы в области естественных наук, гуманитарных наук, инженерии, экономики и медицины.",
    "courseCount": 8
  },
  {
    "id": 2,
    "name": "Назарбаев Университет",
    "description": "Исследовательский университет с международным преподавательским составом, специализирующийся на инженерии, медицине, науках о данных, бизнесе и общественных науках.",
    "courseCount": 5
  },
  {
    "id": 3,
    "name": "Казахский национальный исследовательский технический университет имени К.И. Сатпаева",
    "description": "Ведущий технический университет, предлагающий программы в области нефтегазового дела, машиностроения, IT, горного дела и энергетики.",
    "courseCount": 7
  },
  {
    "id": 4,
    "name": "Казахско-Британский технический университет",
    "description": "Специализируется на IT, бизнесе, нефтегазовой инженерии, кибербезопасности и управлении проектами.",
    "courseCount": 6
  },
  {
    "id": 5,
    "name": "Университет КИМЭП",
    "description": "Частный университет, ориентированный на бизнес, экономику, юриспруденцию, международные отношения и медиа-коммуникации.",
    "courseCount": 4
  },
  {
    "id": 6,
    "name": "Евразийский национальный университет имени Л.Н. Гумилёва",
    "description": "Один из ведущих университетов в области истории, международных отношений, инженерии, IT и естественных наук.",
    "courseCount": 9
  },
  {
    "id": 7,
    "name": "Казахский национальный женский педагогический университет",
    "description": "Специализируется на педагогических науках, психологии, филологии, социальной работе и дошкольном образовании.",
    "courseCount": 3
  },
  {
    "id": 8,
    "name": "Казахский университет международных отношений и мировых языков имени Абылай хана",
    "description": "Специализируется на лингвистике, международных отношениях, переводческом деле, журналистике и востоковедении.",
    "courseCount": 5
  },
  {
    "id": 9,
    "name": "Южно-Казахстанский государственный университет",
    "description": "Многопрофильный университет, предлагающий программы в области аграрных наук, инженерии, экономики, педагогики и IT.",
    "courseCount": 6
  },
  {
    "id": 10,
    "name": "Астана IT Университет",
    "description": "Современный университет, специализирующийся на IT, кибербезопасности, программной инженерии, искусственном интеллекте и цифровых технологиях.",
    "courseCount": 7
  }
]
